docs/esoteric.md
- [many-to-one includes one-to-one](#orgbe73cd4)
- [one-to-many is NOT a function](#org8dd4e2a)
- [One](#org404f455)
- [Introduction and elimination](#org7dbfa12)
- [Duality means nothing](#orgabd6fc9)
- [Logic](#org198929f)
- [Opposites](#orgea78570)
  - [Isomorphic structures](#org71059ef)
  - [&ldquo;together&rdquo; versus &ldquo;apart&rdquo;](#orgb9581f0)
- [Coproduct is not the same as Product](#org76af3b5)
  - [An *ordered pair* (defines or introduces a structure)](#orgc458488)
  - [A *tagged disjoint union* (defines or introduces potential outcomes)](#orgba25491)



<a id="orgbe73cd4"></a>

# many-to-one includes one-to-one


<a id="org8dd4e2a"></a>

# one-to-many is NOT a function

There is always only one &ldquo;outgoing arrow&rdquo; in a proper *mapping*.


<a id="org404f455"></a>

# One

What is the *meaning* (what does it mean) that, according to lengthy definitions of the Category theory, there is an arrow (a function) from a &ldquo;singleton set&rdquo; to every element of *any other* set, including itself.

The number *one* is special. It, denotes the universal notion which is the same as &ldquo;there exists a&rdquo;.

As our perception, awareness and attention *selects* a particular &ldquo;object&rdquo;, it is one-of-many (one-from-many). One is exactly how many.

The abstract notion that an arow from a singleton set &ldquo;selects&rdquo; an element in another set, is the same as an external observer observes (and selects) this very element.

A singleton set could be constructed from every element of any set.


<a id="org7dbfa12"></a>

# Introduction and elimination

Not arbitrary. Constructor &ldquo;introduces&rdquo;, structural pattern-matching &ldquo;eliminates&rdquo;. Or a bunch of individual &ldquo;getters&rdquo;.


<a id="orgabd6fc9"></a>

# Duality means nothing

The abstract notion of &ldquo;reversing of all arrows&rdquo; does not yield &ldquo;the same&rdquo; structure.

It produces a similarly looking structure (to an external observer) which has a similar shape.

The &ldquo;same information, different structure meme&rdquo; is misleading there.

The postulated *duality* (based on diagrams) of a *Product* and a *Sum* (Coproduct) is an *empty abstract notion*.


<a id="org198929f"></a>

# Logic

In logic `AND` (and `OR`) is &ldquo;symmetric&rdquo;, just like `+`. &#x2013; rotate an observer around the expression and you will see *why*.

$$A \and B = B \and A$$

There is no notion of *&ldquo;which one comes first&rdquo;*, because both `+` and `AND` capture the universal notion of &ldquo;putting together&rdquo;.

So when we *curry and partially apply* corresponding *binary /operators*, the order of arguments is irrelevant (unlike subtraction).

there are 3 immediate *implications*: $$A \and B \Rightarrow A$$ $$A \and B \Rightarrow B$$ $$A \and B \Rightarrow B \and A$$

`OR` is &ldquo;like `+`&rdquo; too, but for a different reason. It *&ldquo;binds&rdquo;* together (captures) its arguments, and the which one comes first is irrelevant.


<a id="orgea78570"></a>

# Opposites

Logic, however is abstract (just right!). In reality *everything has its structure*, which logic miraculously abstracts away.

Yes, indeed `x,y` is an opposite of `x|y`. The `NOT` operator is trivially applicable. These are, however, principally different structures.

`x,y != y,x` while `x|y == y|x`. Same &ldquo;information&rdquo;, different structure. And not even the same information &#x2013; it could be `x|_`.

Actually, $x|_, \forall x$, which means `x` or *everything else*, which corresponds to an *introduction of a logical disjunction*.

Every single entity is implicitly *partitioned* by from everything else, by its structure or via membrane, or by just being a distinct sub-process.

Mathematicians have abstracted away these subtle differences. This is a mistake, it yields *empty*, too general to be applicable, abstractions.

Yes, yes, pure mathematicians are not concerned with such &ldquo;irrelevant redundancy&rdquo; like existence, *applicability* or representation of their &ldquo;objects&rdquo;. So we are not so much concerned with pure mathematicians.


<a id="org71059ef"></a>

## Isomorphic structures

Any *representation* (actual structure) implies an implicit (emergent) ordering, so the pair has to be ordered, `(a,b) != (b,a)` &#x2013; representations are different.

The question where `((a, b), c) = (a, (b, c))` &#x2013; same information, different structure (representation) &#x2013; is a true assertion is a very subtle one. Considering *information* alone, these two representations are *isomorphic* to each other, and thus *equivalent*, or even *equal*, depending on a context.

Some structures are symmetric, others aren&rsquo;t. This universal notion also cannot be just abstracted away and ignored.


<a id="orgb9581f0"></a>

## &ldquo;together&rdquo; versus &ldquo;apart&rdquo;

A proper use of a language is to describe What Is, and to find out unabigous words to form a valid associations. This is not only math, it is a proper philosohy too. We have to carefully watch out for &ldquo;overloading&rdquo; of terms and switch contexts only when they are &ldquo;proper subsets&rdquo; (so zomming in and out is valid).

The most universal context (or a Universal set) is &ldquo;What Is&rdquo;. Whatever is not a proper subset of it (something that isn&rsquo;t is added) is technically *bullshit*.

&ldquo;Together&rdquo; means &ldquo;parts of the same structure&rdquo;, which implies &ldquo;moves together&rdquo;, among other things.

&ldquo;Apart&rdquo; has lots of meanings, from *&ldquo;partitioned&rdquo;* to *&ldquo;unrelated&rdquo;*.

The proper notion is of *locality* or *proximity* from phisics (which describes What Is). The universal law of &ldquo;the square of a distance&rdquo; implies that &ldquo;unrelated&rdquo; means too distant, to far away.

Unrelated does NOT mean unobserved. It has nothing to do with whether related or not.


<a id="org76af3b5"></a>

# Coproduct is not the same as Product

What looks similar (alike to an observer) is actually completely different.


<a id="orgc458488"></a>

## An *ordered pair* (defines or introduces a structure)

A Product &ldquo;puts together in an actual structure&rdquo;.

-   A *type-constructor* requires two (can be partially applied)
-   Introduction &#x2013; a *data-constructor* of arity two.
-   Elimination &#x2013; Two distinct patterns to match *on a STRUCTURE*.

Both (two) &ldquo;outgoing arrows&rdquo; (pair of selectors) are actualized


<a id="orgba25491"></a>

## A *tagged disjoint union* (defines or introduces potential outcomes)

A Coproduct &ldquo;is either one or another &#x2013; one &rdquo;slot".

-   A *type-constructor* requires two (can be partially applied) This is where the similarity ends.
-   Introduction &#x2013; a data-constructor of arity one.
-   Elimination &#x2013; two distinct patterns to match *on a TAG*. Apparent similarity here

One (and only one) &ldquo;outgoing arrow&rdquo; (selector) is actualized

Two potential paths, one actual (one-to-many is only potential, one-to-one is only possible actual)
